content-org/all-posts.org
#+hugo_base_dir: ../
#+hugo_section: ./posts

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t

#+author: T, Ivan

# do =C-c C-e H H= to export just this post.

** DONE Epwing dictionaries
   :PROPERTIES:
   :EXPORT_FILE_NAME: epwing-dictionaries
   :END:
*** What is EPWING?
    It seems to be a legacy format for dictionary data, that was
    / is mostly used by Japanese electronic dictionaries. I remember
    someone complaining about its great inconsistency as a format, so
    as to make importing data from it difficult. It seems that there
    needs to be custom parsers written for each different publishers
    version of the format. I came across it as a Japanese learner. 
    The browser dictionary extension [[https://foosoft.net/projects/yomichan/][yomichan]] can import some of these
    to provide J:J [fn:: Japanese word with Japanese definition] look
    ups. The  J:J dictionaries I find most useful are the ones
    targeted at people of my reading level (kids). These are not
    available as EPWING. 
*** Why do I care?
    Because yomichan sometimes doesn't give you the defintion of
    longer phrases, and I wanted to find a dictionary that might have
    contained longer connected keywords, so I could make flashcards
    directly of those, instead of their component parts.
*** Why this post?  
    to remember that there is a big collection of them [[https://onedrive.live.com/?id=AC31052BF2B8CA11%211937&cid=AC31052BF2B8CA11][here]].


