content/posts/epwing-dictionaries.md
+++
title = "Epwing dictionaries"
author = ["T", "Ivan"]
lastmod = 2019-12-10T18:30:51+09:00
weight = 2002
draft = false
+++

## What is EPWING? {#what-is-epwing}

It seems to be a legacy format for dictionary data, that was
/ is mostly used by Japanese electronic dictionaries. I remember
someone complaining about its great inconsistency as a format, so
as to make importing data from it difficult. It seems that there
needs to be custom parsers written for each different publishers
version of the format. I came across it as a Japanese learner.
The browser dictionary extension [yomichan](https://foosoft.net/projects/yomichan/) can import some of these
to provide J:J&nbsp;[^fn:1] look
ups. The  J:J dictionaries I find most useful are the ones
targeted at people of my reading level (kids). These are not
available as EPWING.


## Why do I care? {#why-do-i-care}

Because yomichan sometimes doesn't give you the defintion of
longer phrases, and I wanted to find a dictionary that might have
contained longer connected keywords, so I could make flashcards
directly of those, instead of their component parts.


## Why this post? {#why-this-post}

to remember that there is a big collection of them [here](https://onedrive.live.com/?id=AC31052BF2B8CA11%211937&cid=AC31052BF2B8CA11).

[^fn:1]: Japanese word with Japanese definition
